In [2]:
import pandas as pd
sales=pd.read_csv("sales.csv",index_col=0)
sales.head()

,date,department,fuel_price_usd_per_l,is_holiday,store,temperature_c,type,unemployment,weekly_sales
0,2010-02-05,1,0.679451,False,1,5.727778,A,8.106,24924.50
1,2010-03-05,1,0.693452,False,1,8.055556,A,8.106,21827.90
2,2010-04-02,1,0.718284,False,1,16.816667,A,7.808,57258.43
3,2010-05-07,1,0.748928,False,1,22.527778,A,7.808,17413.94
4,2010-06-04,1,0.714586,False,1,27.050000,A,7.808,17558.09

In [12]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50 entries, 0 to 49
Data columns (total 9 columns):
date                    50 non-null object
department              50 non-null int64
fuel_price_usd_per_l    50 non-null float64
is_holiday              50 non-null bool
store                   50 non-null int64
temperature_c           50 non-null float64
type                    50 non-null object
unemployment            50 non-null float64
weekly_sales            50 non-null float64
dtypes: bool(1), float64(4), int64(2), object(2)
memory usage: 3.6+ KB

In [13]:
sales.describe()

,department,fuel_price_usd_per_l,store,temperature_c,unemployment,weekly_sales
count,50.000000,50.000000,50.0,50.000000,50.000000,50.000000
mean,2.600000,0.710185,1.0,17.954333,7.864480,30426.484400
std,1.212183,0.029389,0.0,8.689827,0.124708,14645.631478
min,1.000000,0.679451,1.0,5.727778,7.742000,7857.880000
25%,2.000000,0.689093,1.0,9.038889,7.787000,16603.340000
50%,3.000000,0.705076,1.0,16.816667,7.808000,34575.665000
75%,4.000000,0.715378,1.0,27.050000,7.838000,42645.187500
max,5.000000,0.786176,1.0,30.644444,8.106000,57258.430000

In [15]:
sales.head()

,date,department,fuel_price_usd_per_l,is_holiday,store,temperature_c,type,unemployment,weekly_sales
0,2010-02-05,1,0.679451,False,1,5.727778,A,8.106,24924.50
1,2010-03-05,1,0.693452,False,1,8.055556,A,8.106,21827.90
2,2010-04-02,1,0.718284,False,1,16.816667,A,7.808,57258.43
3,2010-05-07,1,0.748928,False,1,22.527778,A,7.808,17413.94
4,2010-06-04,1,0.714586,False,1,27.050000,A,7.808,17558.09

In [16]:
sales.mean()

department                  2.600000
fuel_price_usd_per_l        0.710185
is_holiday                  0.000000
store                       1.000000
temperature_c              17.954333
unemployment                7.864480
weekly_sales            30426.484400
dtype: float64

In [17]:
sales["weekly_sales"].mean()

30426.4844

In [18]:
sales["weekly_sales"].median()

34575.66499999999

In [19]:
sales["date"].max()

'2011-01-07'

In [20]:
sales["date"].min()

'2010-02-05'

In [21]:
def iqr(column):
    return column.quantile(0.75)- column.quantile(0.25)

In [23]:
sales["temperature_c"].agg(iqr)

18.011111111111106

In [27]:
sales["weekly_sales"].quantile(0.80) - sales["weekly_sales"].quantile(0.25)

29336.162

In [32]:
sales_1_1=pd.read_csv("sales1.csv",index_col=0)

In [33]:
sales_1_1.head()

,date,department,fuel_price_usd_per_l,is_holiday,store,temperature_c,type,unemployment,weekly_sales
0,2010-02-05,1,0.679451,False,1,5.727778,A,8.106,24924.50
1,2010-03-05,1,0.693452,False,1,8.055556,A,8.106,21827.90
2,2010-04-02,1,0.718284,False,1,16.816667,A,7.808,57258.43
3,2010-05-07,1,0.748928,False,1,22.527778,A,7.808,17413.94
4,2010-06-04,1,0.714586,False,1,27.050000,A,7.808,17558.09

In [34]:
sales_1_1=sales_1_1.sort_values("date")

In [35]:
sales_1_1["cum_weekly_sales"]=sales_1_1["weekly_sales"].cumsum()

In [37]:
sales_1_1.head()

,date,department,fuel_price_usd_per_l,is_holiday,store,temperature_c,type,unemployment,weekly_sales,cum_weekly_sales
0,2010-02-05,1,0.679451,False,1,5.727778,A,8.106,24924.50,24924.50
1,2010-03-05,1,0.693452,False,1,8.055556,A,8.106,21827.90,46752.40
2,2010-04-02,1,0.718284,False,1,16.816667,A,7.808,57258.43,104010.83
3,2010-05-07,1,0.748928,False,1,22.527778,A,7.808,17413.94,121424.77
4,2010-06-04,1,0.714586,False,1,27.050000,A,7.808,17558.09,138982.86

In [38]:
sales_1_1["cum_max_sales"]=sales_1_1["weekly_sales"].cummax()

In [39]:
sales_1_1.head()

,date,department,fuel_price_usd_per_l,is_holiday,store,temperature_c,type,unemployment,weekly_sales,cum_weekly_sales,cum_max_sales
0,2010-02-05,1,0.679451,False,1,5.727778,A,8.106,24924.50,24924.50,24924.50
1,2010-03-05,1,0.693452,False,1,8.055556,A,8.106,21827.90,46752.40,24924.50
2,2010-04-02,1,0.718284,False,1,16.816667,A,7.808,57258.43,104010.83,57258.43
3,2010-05-07,1,0.748928,False,1,22.527778,A,7.808,17413.94,121424.77,57258.43
4,2010-06-04,1,0.714586,False,1,27.050000,A,7.808,17558.09,138982.86,57258.43

In [40]:
sales.head()

,date,department,fuel_price_usd_per_l,is_holiday,store,temperature_c,type,unemployment,weekly_sales
0,2010-02-05,1,0.679451,False,1,5.727778,A,8.106,24924.50
1,2010-03-05,1,0.693452,False,1,8.055556,A,8.106,21827.90
2,2010-04-02,1,0.718284,False,1,16.816667,A,7.808,57258.43
3,2010-05-07,1,0.748928,False,1,22.527778,A,7.808,17413.94
4,2010-06-04,1,0.714586,False,1,27.050000,A,7.808,17558.09

In [41]:
store_types=sales.drop_duplicates(subset=["store","type"])

In [42]:
store_depts=sales.drop_duplicates(subset=["store","department"])

In [43]:
store_depts.head()

,date,department,fuel_price_usd_per_l,is_holiday,store,temperature_c,type,unemployment,weekly_sales
0,2010-02-05,1,0.679451,False,1,5.727778,A,8.106,24924.50
12,2010-02-05,2,0.679451,False,1,5.727778,A,8.106,50605.27
24,2010-02-05,3,0.679451,False,1,5.727778,A,8.106,13740.12
36,2010-02-05,4,0.679451,False,1,5.727778,A,8.106,39954.04
48,2010-02-05,5,0.679451,False,1,5.727778,A,8.106,32229.38

In [47]:
sales[sales["is_holiday"]].drop_duplicates(subset="date")

Empty DataFrame
Columns: [date, department, fuel_price_usd_per_l, is_holiday, store, temperature_c, type, unemployment, weekly_sales]
Index: []

In [49]:
sales["type"].value_counts()

A    50
Name: type, dtype: int64

In [50]:
sales["type"].value_counts(normalize=True)

A    1.0
Name: type, dtype: float64

In [57]:
sales["department"].value_counts(sort=False)

1    12
2    12
3    12
4    12
5     2
Name: department, dtype: int64

In [58]:
sales["department"].value_counts(sort=False,normalize=True)

1    0.24
2    0.24
3    0.24
4    0.24
5    0.04
Name: department, dtype: float64

In [59]:
sales.head()

,date,department,fuel_price_usd_per_l,is_holiday,store,temperature_c,type,unemployment,weekly_sales
0,2010-02-05,1,0.679451,False,1,5.727778,A,8.106,24924.50
1,2010-03-05,1,0.693452,False,1,8.055556,A,8.106,21827.90
2,2010-04-02,1,0.718284,False,1,16.816667,A,7.808,57258.43
3,2010-05-07,1,0.748928,False,1,22.527778,A,7.808,17413.94
4,2010-06-04,1,0.714586,False,1,27.050000,A,7.808,17558.09

In [74]:
sales_all=sales["weekly_sales"].sum()

In [66]:
sales_A=sales[sales["type"]=="A"]["weekly_sales"].sum()

In [67]:
print(sales_A)

1521324.2199999997

In [68]:
sales_B=sales[sales["type"]=="B"]["weekly_sales"].sum()

In [69]:
print(sales_B)

0.0

In [71]:
sales_C=sales[sales["type"]=="C"]["weekly_sales"].sum()

In [72]:
print(sales_C)

0.0

In [75]:
[sales_A,sales_B,sales_C]/sales_all

array([1., 0., 0.])

In [79]:
sales_by_type=sales.groupby("type")["weekly_sales"].sum()

In [80]:
sales_by_type

type
A    1521324.22
Name: weekly_sales, dtype: float64

In [81]:
sales_by_type/sum(sales_by_type)

type
A    1.0
Name: weekly_sales, dtype: float64

In [82]:
sales.groupby(["type","is_holiday"])["weekly_sales"].sum()

type  is_holiday
A     False         1521324.22
Name: weekly_sales, dtype: float64

In [83]:
sales.groupby(["type","is_holiday"])["weekly_sales"].agg([np.min,np.max,np.mean,np.median])

                    amin      amax        mean     median
type is_holiday
A    False       7857.88  57258.43  30426.4844  34575.665

In [84]:
sales.groupby(["type","is_holiday"])["weekly_sales","fuel_price_usd_per_l"].agg([np.min,np.max,np.mean,np.median])

                weekly_sales                                   \
                        amin      amax        mean     median
type is_holiday
A    False           7857.88  57258.43  30426.4844  34575.665

                fuel_price_usd_per_l
                                amin      amax      mean    median
type is_holiday
A    False                  0.679451  0.786176  0.710185  0.705076

In [85]:
sales.pivot_table(index="type",values="weekly_sales")

      weekly_sales
type
A       30426.4844

In [90]:
sales.groupby(["type","is_holiday"])["weekly_sales"].mean()

type  is_holiday
A     False         30426.4844
Name: weekly_sales, dtype: float64

In [87]:
import numpy as np

In [88]:
sales.pivot_table(index="type",values="weekly_sales",aggfunc=[np.mean,np.median])

             mean       median
     weekly_sales weekly_sales
type
A      30426.4844    34575.665

In [89]:
sales.pivot_table(index="type",values="weekly_sales",columns="is_holiday")

is_holiday       False
type
A           30426.4844

In [92]:
sales.pivot_table(index="department",columns="type",values="weekly_sales",fill_value=0)

type                   A
department
1           23491.755000
2           47421.124167
3           12872.590000
4           38382.255833
5           27655.760000

In [93]:
sales.pivot_table(index="department",columns="type",values="weekly_sales",fill_value=0,margins=True)

type                   A           All
department
1           23491.755000  23491.755000
2           47421.124167  47421.124167
3           12872.590000  12872.590000
4           38382.255833  38382.255833
5           27655.760000  27655.760000
All         30426.484400  30426.484400

In [ ]:
dataframe.sort_values("columnname")

In [ ]:
dataframe[Expression]

In [ ]:
dataframe["colunname"]

In [ ]:
dataframe["newcolumnname"]=Operation